nienine_cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "name" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "2021-09-07"], ["name", "Jeff-edit"], ["updated_at", "2021-09-17 21:23:36.261413"], ["id", 3]]